{
    "class_name": "Functional",
    "config": {
        "name": "functional_3",
        "layers": [{
            "class_name": "InputLayer",
            "config": {
                "batch_input_shape": [null, 32, 128, 1],
                "dtype": "float32",
                "sparse": false,
                "ragged": false,
                "name": "input_4"
            },
            "name": "input_4",
            "inbound_nodes": []
        }, {
            "class_name": "Conv2D",
            "config": {
                "name": "conv2d_9",
                "trainable": true,
                "dtype": "float32",
                "filters": 64,
                "kernel_size": [3, 3],
                "strides": [1, 1],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [1, 1],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "name": "conv2d_9",
            "inbound_nodes": [
                [
                    ["input_4", 0, 0, {}]
                ]
            ]
        }, {
            "class_name": "MaxPooling2D",
            "config": {
                "name": "max_pooling2d_4",
                "trainable": true,
                "dtype": "float32",
                "pool_size": [2, 2],
                "padding": "valid",
                "strides": [2, 2],
                "data_format": "channels_last"
            },
            "name": "max_pooling2d_4",
            "inbound_nodes": [
                [
                    ["conv2d_9", 0, 0, {}]
                ]
            ]
        }, {
            "class_name": "Conv2D",
            "config": {
                "name": "conv2d_10",
                "trainable": true,
                "dtype": "float32",
                "filters": 128,
                "kernel_size": [3, 3],
                "strides": [1, 1],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [1, 1],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "name": "conv2d_10",
            "inbound_nodes": [
                [
                    ["max_pooling2d_4", 0, 0, {}]
                ]
            ]
        }, {
            "class_name": "MaxPooling2D",
            "config": {
                "name": "max_pooling2d_5",
                "trainable": true,
                "dtype": "float32",
                "pool_size": [2, 2],
                "padding": "valid",
                "strides": [2, 2],
                "data_format": "channels_last"
            },
            "name": "max_pooling2d_5",
            "inbound_nodes": [
                [
                    ["conv2d_10", 0, 0, {}]
                ]
            ]
        }, {
            "class_name": "Conv2D",
            "config": {
                "name": "conv2d_11",
                "trainable": true,
                "dtype": "float32",
                "filters": 256,
                "kernel_size": [3, 3],
                "strides": [1, 1],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [1, 1],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "name": "conv2d_11",
            "inbound_nodes": [
                [
                    ["max_pooling2d_5", 0, 0, {}]
                ]
            ]
        }, {
            "class_name": "Conv2D",
            "config": {
                "name": "conv2d_12",
                "trainable": true,
                "dtype": "float32",
                "filters": 256,
                "kernel_size": [3, 3],
                "strides": [1, 1],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [1, 1],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "name": "conv2d_12",
            "inbound_nodes": [
                [
                    ["conv2d_11", 0, 0, {}]
                ]
            ]
        }, {
            "class_name": "MaxPooling2D",
            "config": {
                "name": "max_pooling2d_6",
                "trainable": true,
                "dtype": "float32",
                "pool_size": [2, 1],
                "padding": "valid",
                "strides": [2, 1],
                "data_format": "channels_last"
            },
            "name": "max_pooling2d_6",
            "inbound_nodes": [
                [
                    ["conv2d_12", 0, 0, {}]
                ]
            ]
        }, {
            "class_name": "Conv2D",
            "config": {
                "name": "conv2d_13",
                "trainable": true,
                "dtype": "float32",
                "filters": 512,
                "kernel_size": [3, 3],
                "strides": [1, 1],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [1, 1],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "name": "conv2d_13",
            "inbound_nodes": [
                [
                    ["max_pooling2d_6", 0, 0, {}]
                ]
            ]
        }, {
            "class_name": "BatchNormalization",
            "config": {
                "name": "batch_normalization_2",
                "trainable": true,
                "dtype": "float32",
                "axis": [3],
                "momentum": 0.99,
                "epsilon": 0.001,
                "center": true,
                "scale": true,
                "beta_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "gamma_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "moving_mean_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "moving_variance_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "beta_regularizer": null,
                "gamma_regularizer": null,
                "beta_constraint": null,
                "gamma_constraint": null
            },
            "name": "batch_normalization_2",
            "inbound_nodes": [
                [
                    ["conv2d_13", 0, 0, {}]
                ]
            ]
        }, {
            "class_name": "Conv2D",
            "config": {
                "name": "conv2d_14",
                "trainable": true,
                "dtype": "float32",
                "filters": 512,
                "kernel_size": [3, 3],
                "strides": [1, 1],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [1, 1],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "name": "conv2d_14",
            "inbound_nodes": [
                [
                    ["batch_normalization_2", 0, 0, {}]
                ]
            ]
        }, {
            "class_name": "BatchNormalization",
            "config": {
                "name": "batch_normalization_3",
                "trainable": true,
                "dtype": "float32",
                "axis": [3],
                "momentum": 0.99,
                "epsilon": 0.001,
                "center": true,
                "scale": true,
                "beta_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "gamma_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "moving_mean_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "moving_variance_initializer": {
                    "class_name": "Ones",
                    "config": {}
                },
                "beta_regularizer": null,
                "gamma_regularizer": null,
                "beta_constraint": null,
                "gamma_constraint": null
            },
            "name": "batch_normalization_3",
            "inbound_nodes": [
                [
                    ["conv2d_14", 0, 0, {}]
                ]
            ]
        }, {
            "class_name": "MaxPooling2D",
            "config": {
                "name": "max_pooling2d_7",
                "trainable": true,
                "dtype": "float32",
                "pool_size": [2, 1],
                "padding": "valid",
                "strides": [2, 1],
                "data_format": "channels_last"
            },
            "name": "max_pooling2d_7",
            "inbound_nodes": [
                [
                    ["batch_normalization_3", 0, 0, {}]
                ]
            ]
        }, {
            "class_name": "Conv2D",
            "config": {
                "name": "conv2d_15",
                "trainable": true,
                "dtype": "float32",
                "filters": 512,
                "kernel_size": [2, 2],
                "strides": [1, 1],
                "padding": "valid",
                "data_format": "channels_last",
                "dilation_rate": [1, 1],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "name": "conv2d_15",
            "inbound_nodes": [
                [
                    ["max_pooling2d_7", 0, 0, {}]
                ]
            ]
        }, {
            "class_name": "Lambda",
            "config": {
                "name": "lambda_1",
                "trainable": true,
                "dtype": "float32",
                "function": ["4wEAAAAAAAAAAQAAAAQAAABDAAAAcwwAAAB0AKABfABkAaECUwApAk7pAQAAACkC2gFL2gdzcXVl\nZXplKQHaAXipAHIFAAAA+h88aXB5dGhvbi1pbnB1dC0yMi04M2FjNWJkNDQxODc+2gg8bGFtYmRh\nPhwAAADzAAAAAA==\n", null, null],
                "function_type": "lambda",
                "module": "__main__",
                "output_shape": null,
                "output_shape_type": "raw",
                "output_shape_module": null,
                "arguments": {}
            },
            "name": "lambda_1",
            "inbound_nodes": [
                [
                    ["conv2d_15", 0, 0, {}]
                ]
            ]
        }, {
            "class_name": "Bidirectional",
            "config": {
                "name": "bidirectional_2",
                "trainable": true,
                "dtype": "float32",
                "layer": {
                    "class_name": "LSTM",
                    "config": {
                        "name": "lstm_2",
                        "trainable": true,
                        "dtype": "float32",
                        "return_sequences": true,
                        "return_state": false,
                        "go_backwards": false,
                        "stateful": false,
                        "unroll": false,
                        "time_major": false,
                        "units": 128,
                        "activation": "tanh",
                        "recurrent_activation": "sigmoid",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            }
                        },
                        "recurrent_initializer": {
                            "class_name": "Orthogonal",
                            "config": {
                                "gain": 1.0,
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "unit_forget_bias": true,
                        "kernel_regularizer": null,
                        "recurrent_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "recurrent_constraint": null,
                        "bias_constraint": null,
                        "dropout": 0.2,
                        "recurrent_dropout": 0.0,
                        "implementation": 2
                    }
                },
                "merge_mode": "concat"
            },
            "name": "bidirectional_2",
            "inbound_nodes": [
                [
                    ["lambda_1", 0, 0, {}]
                ]
            ]
        }, {
            "class_name": "Bidirectional",
            "config": {
                "name": "bidirectional_3",
                "trainable": true,
                "dtype": "float32",
                "layer": {
                    "class_name": "LSTM",
                    "config": {
                        "name": "lstm_3",
                        "trainable": true,
                        "dtype": "float32",
                        "return_sequences": true,
                        "return_state": false,
                        "go_backwards": false,
                        "stateful": false,
                        "unroll": false,
                        "time_major": false,
                        "units": 128,
                        "activation": "tanh",
                        "recurrent_activation": "sigmoid",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            }
                        },
                        "recurrent_initializer": {
                            "class_name": "Orthogonal",
                            "config": {
                                "gain": 1.0,
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "unit_forget_bias": true,
                        "kernel_regularizer": null,
                        "recurrent_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "recurrent_constraint": null,
                        "bias_constraint": null,
                        "dropout": 0.2,
                        "recurrent_dropout": 0.0,
                        "implementation": 2
                    }
                },
                "merge_mode": "concat"
            },
            "name": "bidirectional_3",
            "inbound_nodes": [
                [
                    ["bidirectional_2", 0, 0, {}]
                ]
            ]
        }, {
            "class_name": "Dense",
            "config": {
                "name": "dense_1",
                "trainable": true,
                "dtype": "float32",
                "units": 63,
                "activation": "softmax",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "name": "dense_1",
            "inbound_nodes": [
                [
                    ["bidirectional_3", 0, 0, {}]
                ]
            ]
        }],
        "input_layers": [
            ["input_4", 0, 0]
        ],
        "output_layers": [
            ["dense_1", 0, 0]
        ]
    },
    "keras_version": "2.4.0",
    "backend": "tensorflow"
}